# GetParameterTypeId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
InternalDefinition..::..GetParameterTypeId Method
InternalDefinition Class See Also
---
Tests whether this definition identifies a built-in parameter or not.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ForgeTypeId GetParameterTypeId()
```

Visual Basic
---
```text
Public Function GetParameterTypeId As ForgeTypeId
```

Visual C++
---
```text
public:
ForgeTypeId^ GetParameterTypeId()
```

# Remarks
For a built-in parameter this method returns one of the ParameterTypeId static properties. For custom-defined parameters, such as shared, global, or family parameters the value is null.
# See Also
InternalDefinition Class
Autodesk.Revit.DB Namespace